app/Controllers/GudangController.php

SELECT *
FROM `layout`
ORDER BY `jalur` ASC
SELECT SUM(`box_stock`) AS `total`
FROM `stock`
WHERE `jalur` = 'A.1.01'
 LIMIT 1
---
    public function importStockTanpaLibrary()
    {
        ini_set('max_execution_time', 300);
        $admin         = session()->get('username');
        $file          = $this->request->getFile('file');
        $today         = (new \DateTime('now'))->modify('+2 day')->setTime(0, 0, 0);

        // Validasi file
        if (! $file || ! $file->isValid() || $file->hasMoved()) {
            return redirect()->back()->with('error', 'File tidak valid.');
        }

        // Upload & baca sheet
        $uploadPath    = WRITEPATH . 'uploads/';
        $file->move($uploadPath);
        $fullPath      = $uploadPath . $file->getName();
        $sheetArr      = \PhpOffice\PhpSpreadsheet\IOFactory::load($fullPath)
            ->getActiveSheet()
            ->toArray(null, true, true, true);
        unlink($fullPath);

        $failedRows      = [];
        $errorDetails    = [];
        $pointsRaw       = [];
        $skippedExists   = [];

        // Siapkan layout & kapasitas awal per jalur
        $layouts         = $this->layoutModel->orderBy('jalur', 'ASC')->findAll();
        $jalurCapacity   = [];
        foreach ($layouts as $L) {
            $used = $this->stockModel
                ->where('jalur', $L['jalur'])
                ->selectSum('box_stock', 'total')
                ->first()['total'] ?? 0;

SELECT *
FROM `stock`
WHERE `id_anak` = '1856'
AND DATE(created_at) = '2025-07-27'
 LIMIT 1
---
            $qtyBoxes = round((float)$qty / 24, 2);

            // Cek stock eksisting dan penempatan berdasarkan model+tanggal
            $exists = $this->stockModel->where('id_anak', $dataAnak['id_anak'])
                ->where("DATE(created_at) = '{$today->format('Y-m-d')}'", null, false)
                ->first();