app/Models/LayoutModel.php

    public function getDataJalur()
    {
        return $this->select("
            layout.jalur,
            layout.jumlah_box,
            (layout.jumlah_box - COALESCE(SUM(stock.box_stock), 0)) AS space,
            SUM(COALESCE(stock.qty_stock, 0)) AS qty_stock,
            SUM(COALESCE(stock.box_stock, 0)) AS box_stock,
            GROUP_CONCAT(DISTINCT tabel_induk.no_model SEPARATOR ', ') AS models,
            layout.keterangan
        ")
            ->join('stock',        'layout.jalur = stock.jalur',             'left')
            ->join('tabel_anak',   'stock.id_anak = tabel_anak.id_anak',      'left')
            ->join('tabel_induk',  'tabel_induk.id_induk = tabel_anak.id_induk', 'left')
            ->groupBy('layout.jalur')
            ->orderBy('layout.jalur', 'ASC')
            ->findAll();
---
SELECT `layout`.`jalur`, `layout`.`jumlah_box`, (layout.jumlah_box - COALESCE(SUM(stock.box_stock), 0)) AS space, SUM(COALESCE(stock.qty_stock, 0)) AS qty_stock, SUM(COALESCE(stock.box_stock, 0)) AS box_stock, GROUP_CONCAT(DISTINCT tabel_induk.no_model SEPARATOR ', ') AS models, `layout`.`keterangan`
FROM `layout`
LEFT JOIN `stock` ON `layout`.`jalur` = `stock`.`jalur`
LEFT JOIN `tabel_anak` ON `stock`.`id_anak` = `tabel_anak`.`id_anak`
LEFT JOIN `tabel_induk` ON `tabel_induk`.`id_induk` = `tabel_anak`.`id_induk`
GROUP BY `layout`.`jalur`
ORDER BY `layout`.`jalur` ASC