app/Models/StockModel.php

SELECT `layout`.`jalur`, SUM(COALESCE(stock.qty_stock, 0)) AS qty_stock, SUM(COALESCE(stock.box_stock, 0)) AS box_stock, `tabel_induk`.`no_model`, `tabel_anak`.`area`, `tabel_anak`.`inisial`, `tabel_anak`.`style`, `tabel_anak`.`warna`
FROM `stock`
LEFT JOIN `layout` ON `layout`.`jalur` = `stock`.`jalur`
LEFT JOIN `tabel_anak` ON `stock`.`id_anak` = `tabel_anak`.`id_anak`
LEFT JOIN `tabel_induk` ON `tabel_induk`.`id_induk` = `tabel_anak`.`id_induk`
WHERE `layout`.`jalur` = 'A.1.01'
GROUP BY `tabel_anak`.`inisial`
ORDER BY `tabel_induk`.`no_model` ASC, `tabel_anak`.`inisial` ASC
---
    public function getDataStock($jalur)
    {
        return $this->select('layout.jalur, SUM(COALESCE(stock.qty_stock, 0)) AS qty_stock, SUM(COALESCE(stock.box_stock, 0)) AS box_stock, tabel_induk.no_model, tabel_anak.area, tabel_anak.inisial, tabel_anak.style, tabel_anak.warna')
            ->join('layout', 'layout.jalur = stock.jalur', 'left') // left join agar tetap menampilkan jalur walau stock kosong
            ->join('tabel_anak', 'stock.id_anak = tabel_anak.id_anak', 'left') // left join juga untuk tabel anak
            ->join('tabel_induk', 'tabel_induk.id_induk = tabel_anak.id_induk', 'left') // left join untuk tabel induk
            ->where('layout.jalur', $jalur)
            ->groupBy('tabel_anak.inisial')
            ->orderBy('tabel_induk.no_model, tabel_anak.inisial', 'ASC')
            ->findAll();

SELECT `layout`.`jalur`, `tabel_induk`.`no_model`, `tabel_anak`.`area`, `tabel_anak`.`inisial`, `tabel_anak`.`style`, `tabel_anak`.`warna`, SUM(COALESCE(stock.qty_stock, 0))   AS qty_stock, SUM(COALESCE(stock.box_stock, 0))  AS box_stock
FROM `stock`
LEFT JOIN `layout` ON `layout`.`jalur`        = `stock`.`jalur`
LEFT JOIN `tabel_anak` ON `tabel_anak`.`id_anak`   = `stock`.`id_anak`
LEFT JOIN `tabel_induk` ON `tabel_induk`.`id_induk` = `tabel_anak`.`id_induk`
WHERE `layout`.`jalur` = 'A.1.01'
GROUP BY `layout`.`jalur`, `tabel_induk`.`no_model`, `tabel_anak`.`area`, `tabel_anak`.`inisial`, `tabel_anak`.`style`, `tabel_anak`.`warna`
ORDER BY `tabel_induk`.`no_model` ASC, `tabel_anak`.`inisial` ASC
---
    public function getAllStock()
    {
        $now = date('Y-m-d');
        return $this->select('layout.jalur, stock.gd_setting, SUM(COALESCE(stock.qty_stock, 0)) AS qty_stock,(tabel_anak.qty_po_inisial - COALESCE(pengeluaran.qty_keluar, 0)) AS sisa_jatah, SUM(COALESCE(stock.box_stock, 0)) AS box_stock, tabel_induk.no_model, tabel_induk.kode_buyer, tabel_induk.smv, tabel_induk.delivery, tabel_anak.id_anak, tabel_anak.area, tabel_anak.inisial, tabel_anak.style, tabel_anak.warna, tabel_anak.qty_po_inisial, pengeluaran.qty_keluar')
            ->join('layout', 'layout.jalur = stock.jalur', 'left') // left join agar tetap menampilkan jalur walau stock kosong
            ->join('tabel_anak', 'stock.id_anak = tabel_anak.id_anak', 'left') // left join juga untuk tabel anak
            ->join('tabel_induk', 'tabel_induk.id_induk = tabel_anak.id_induk', 'left') // left join untuk tabel induk
            ->join('pengeluaran', 'tabel_anak.id_anak = pengeluaran.id_anak', 'left') // left join untuk tabel induk
            ->where('tabel_induk.delivery >', $now)
            ->groupBy('tabel_induk.no_model, tabel_anak.inisial')
            ->orderBy('tabel_induk.no_model, tabel_anak.inisial', 'ASC')
            ->findAll();