app/Models/TabelIndukModel.php

    public function selectNomodel()
    {
        return $this->select('id_induk, no_model')
            ->findAll();
---
SELECT `id_induk`, `no_model`
FROM `tabel_induk`